houses_app/houses_app_api/app/controllers/listeds_controller.rb

  def index
    @listeds = Listed.all
---
SELECT "listeds".* FROM "listeds"

  def create
    @listed = Listed.new(listed_params)
    @listed.house_id = params[:house_id]

    if @listed.save
---
INSERT INTO "listeds" ("listed_price", "sold_price", "created_at", "updated_at", "house_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["listed_price", 450000], ["sold_price", 430000], ["created_at", "2020-02-16 23:19:50.482730"], ["updated_at", "2020-02-16 23:19:50.482730"], ["house_id", 1]]

  def update
    if @listed.update(listed_params)
---
UPDATE "listeds" SET "listed_price" = $1, "updated_at" = $2 WHERE "listeds"."id" = $3  [["listed_price", 550000], ["updated_at", "2020-02-16 23:21:07.208870"], ["id", 7]]

  def destroy
    @listed.destroy
---
DELETE FROM "listeds" WHERE "listeds"."id" = $1  [["id", 7]]

    def set_listed
      @listed = Listed.find(params[:id])
---
SELECT "listeds".* FROM "listeds" WHERE "listeds"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]